Repository: IbrahimElbazz/anmka_stp
Catalog: lib/l10n/app_*.arb
Languages: ar

# appName
source: Anmka Educational Platform
ar: منصة أنمكا التعليمية

source: Settings
ar: الإعدادات

source: General Settings
ar: الإعدادات العامة

source: Language
ar: اللغة

source: Notifications
ar: الإشعارات

source: Dark Mode
ar: الوضع الداكن

# privacyAndSecurity
source: Privacy & Security
ar: الخصوصية والأمان

# helpAndSupport
source: Help & Support
ar: المساعدة والدعم

source: Change Password
ar: تغيير كلمة المرور

source: Arabic
ar: العربية

source: Select Language
ar: اختر اللغة

# languageChanged
source: Language changed to {name}
ar: تم تغيير اللغة إلى {name}

# preferencesUpdated
source: Preferences updated successfully
ar: تم تحديث التفضيلات بنجاح

source: Error updating preferences
ar: حدث خطأ أثناء تحديث التفضيلات

source: User
ar: المستخدم

source: Login
ar: تسجيل الدخول

source: Email
ar: البريد الإلكتروني

# emailOrPhone
source: Email or Phone Number
ar: البريد الإلكتروني أو رقم الهاتف

# enterEmailOrPhone
source: Enter your email or phone number
ar: أدخل بريدك الإلكتروني أو رقم هاتفك

# invalidEmailOrPhone
source: Invalid email or phone number
ar: البريد الإلكتروني أو رقم الهاتف غير صحيح

source: Password
ar: كلمة المرور

source: Forgot Password?
ar: نسيت كلمة المرور؟

# noAccount
source: Don't have an account?
ar: ليس لديك حساب؟

source: Register Now
ar: سجل الآن

# invalidEmail
source: Invalid email address
ar: البريد الإلكتروني غير صحيح

# pleaseEnterEmail
source: Please enter your email
ar: الرجاء إدخال البريد الإلكتروني

# pleaseEnterPassword
source: Please enter your password
ar: الرجاء إدخال كلمة المرور

source: Welcome back! 👋
ar: مرحباً بعودتك! 👋

# enterEmail
source: Enter your email
ar: أدخل بريدك الإلكتروني

# enterPassword
source: Enter your password
ar: أدخل كلمة المرور

# fieldRequired
source: This field is required
ar: هذا الحقل مطلوب

source: OR
ar: أو

# register
source: Create New Account
ar: إنشاء حساب جديد

# joinUsMessage
source: Join us and start your learning journey 🎓
ar: انضم إلينا وابدأ رحلة التعلم 🎓

source: Full Name
ar: الاسم الكامل

# pleaseEnterName
source: Enter your full name
ar: أدخل اسمك الكامل

# phone
source: Phone Number
ar: رقم الهاتف

source: Student type
ar: نوع الطالب

# inPersonStudent
source: In-class student
ar: طالب محاضري

source: Online student
ar: طالب أونلاين

# bothStudentTypes
source: Both
ar: كلاهما

# selectStudentType
source: Please choose your student type
ar: يرجى اختيار نوع الطالب

# invalidPhone
source: Invalid phone number
ar: رقم الهاتف غير صحيح

source: Enter password again
ar: أدخل كلمة المرور مرة أخرى

source: I agree to
ar: أوافق على

# pleaseAcceptTerms
source: Please accept the terms and conditions
ar: يرجى الموافقة على الشروط والأحكام

source: Create Account
ar: إنشاء الحساب

# alreadyHaveAccount
source: Already have an account?
ar: لديك حساب بالفعل؟

source: Terms and Conditions
ar: الشروط والأحكام

source: Home
ar: الرئيسية

source: Courses
ar: دورات

source: Progress
ar: التقدم

source: Profile
ar: الملف الشخصي

source: Featured Courses
ar: الدورات المميزة

source: Categories
ar: التصنيفات

source: Category
ar: التصنيف

# startLearningJourney
source: Start your learning journey and enroll in your first course
ar: ابدأ رحلة التعلم واشترك في دورتك الأولى

# discount50
source: 50% off on all courses
ar: خصم 50% على جميع الدورات

source: Subscribe Now
ar: اشترك الآن

source: All
ar: الكل

source: Newest
ar: الأحدث

source: Highest Rated
ar: الأعلى تقييماً

source: Best Selling
ar: الأكثر مبيعاً

source: Price: Low to High
ar: السعر: من الأقل

source: Price: High to Low
ar: السعر: من الأعلى

source: Error loading courses
ar: حدث خطأ أثناء تحميل الدورات

source: Instructor
ar: المدرب

source: Lessons
ar: الدروس

source: Lesson
ar: الدرس

source: Course
ar: دورة

# courseSuitable
source: This course is suitable for both beginners and professionals.
ar: الدورة مناسبة للمبتدئين والمحترفين على حد سواء.

# enrolledSuccessfully
source: Enrolled in course successfully
ar: تم الاشتراك في الدورة بنجاح

# errorEnrolling
source: Error enrolling in course
ar: حدث خطأ أثناء الاشتراك في الدورة

source: Added to wishlist
ar: تمت الإضافة إلى قائمة الرغبات

source: Removed from wishlist
ar: تمت الإزالة من قائمة الرغبات

# errorWishlist
source: Error {action} wishlist
ar: حدث خطأ أثناء {action} قائمة الرغبات

source: adding to
ar: الإضافة إلى

source: removing from
ar: الإزالة من

source: Start Exam
ar: بدء الامتحان

source: Error starting exam
ar: حدث خطأ أثناء بدء الامتحان

source: Submit Exam
ar: تقديم الامتحان

source: Error submitting exam
ar: حدث خطأ أثناء تقديم الامتحان

source: Practice Exam
ar: الامتحان التجريبي

source: Question
ar: السؤال

source: Question {number}
ar: السؤال {number}

source: Next
ar: التالي

source: Previous
ar: السابق

# timeTaken
source: Time taken: {minutes} minutes
ar: الوقت المستغرق: {minutes} دقيقة

source: Downloads
ar: التحميلات

# downloadLinkReceived
source: Download link received. Download will start soon...
ar: تم الحصول على رابط التحميل. سيتم التحميل قريباً...

# errorDownloading
source: Error downloading: {error}
ar: حدث خطأ أثناء التحميل: {error}

# fileDeleted
source: File deleted successfully
ar: تم حذف الملف بنجاح

# errorDeleting
source: Error deleting: {error}
ar: حدث خطأ أثناء الحذف: {error}

source: Certificates
ar: الشهادات

# downloadSuccessful
source: Downloaded successfully: {path}
ar: تم التحميل بنجاح: {path}

# errorDownloadingFile
source: Error downloading file: {error}
ar: حدث خطأ أثناء التحميل: {error}

source: Error sharing
ar: حدث خطأ أثناء المشاركة

source: Student
ar: الطالب

source: Live Courses
ar: الكورسات اللايف

# registeredSuccessfully
source: Registered for session successfully
ar: تم التسجيل في الجلسة بنجاح

# errorRegistering
source: Error registering for session
ar: حدث خطأ أثناء التسجيل في الجلسة

source: Sunday
ar: الأحد

source: Monday
ar: الإثنين

source: Tuesday
ar: الثلاثاء

source: Wednesday
ar: الأربعاء

source: Thursday
ar: الخميس

source: Friday
ar: الجمعة

source: Saturday
ar: السبت

source: Enrolled Lessons
ar: الدروس المشترك بها

source: Saved Files
ar: الملفات المحفوظة

source: Main Menu
ar: القائمة الرئيسية

source: Logout
ar: تسجيل الخروج

# errorLoggingOut
source: Error logging out: {error}
ar: حدث خطأ أثناء تسجيل الخروج: {error}

source: Now
ar: الآن

# lessonNumber
source: Lesson {current} of {total}
ar: الدرس {current} من {total}

source: All lessons completed
ar: تم إكمال جميع الدروس

source: Previous Lesson
ar: الدرس السابق

source: Next Lesson
ar: الدرس التالي

# duration
source: Duration: {duration}
ar: المدة: {duration}

source: Not specified
ar: غير محدد

source: Design
ar: التصميم

source: Programming
ar: البرمجة

source: Marketing
ar: التسويق

source: Data
ar: البيانات

source: Checkout
ar: الدفع

# discountApplied
source: Discount applied successfully
ar: تم تطبيق الخصم بنجاح

# errorCheckingDiscount
source: Error checking discount code
ar: حدث خطأ أثناء التحقق من كود الخصم

# purchaseSuccessful
source: Purchase completed successfully
ar: تمت عملية الشراء بنجاح

source: Error completing payment
ar: حدث خطأ أثناء إتمام عملية الدفع

source: Error processing payment
ar: حدث خطأ أثناء عملية الدفع

# discount20
source: 20% discount applied
ar: تم تطبيق الخصم 20%

source: Discount
ar: الخصم

source: Total
ar: الإجمالي

source: Edit Profile
ar: تعديل الملف الشخصي

source: Error loading profile
ar: حدث خطأ أثناء تحميل الملف الشخصي

# profileUpdated
source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح

# errorUpdatingProfile
source: Error updating profile: {error}
ar: حدث خطأ أثناء تحديث الملف الشخصي: {error}

# country
source: Country (Optional)
ar: البلد (اختياري)

# timezone
source: Timezone (Optional)
ar: المنطقة الزمنية (اختياري)

source: Name
ar: الاسم

# bio
source: About You
ar: نبذة عنك

source: Save Changes
ar: حفظ التغييرات

source: Select Image Source
ar: اختر مصدر الصورة

source: Camera
ar: الكاميرا

source: Gallery
ar: المعرض

# cameraPermissionDenied
source: Camera permission denied. Please allow camera access from settings
ar: تم رفض إذن الكاميرا. يرجى السماح بالوصول إلى الكاميرا من الإعدادات

# galleryPermissionDenied
source: Gallery permission denied. Please allow photo access from settings
ar: تم رفض إذن المعرض. يرجى السماح بالوصول إلى الصور من الإعدادات

source: Error picking image
ar: حدث خطأ أثناء اختيار الصورة

# avatarUploaded
source: Avatar uploaded successfully
ar: تم رفع الصورة بنجاح

# errorUploadingAvatar
source: Error uploading avatar: {error}
ar: حدث خطأ أثناء رفع الصورة: {error}

# passwordChanged
source: Password changed successfully
ar: تم تغيير كلمة المرور بنجاح

# errorChangingPassword
source: Error changing password: {error}
ar: حدث خطأ أثناء تغيير كلمة المرور: {error}

source: Current Password
ar: كلمة المرور الحالية

source: New Password
ar: كلمة المرور الجديدة

source: Confirm Password
ar: تأكيد كلمة المرور

source: Please enter current password
ar: الرجاء إدخال كلمة المرور الحالية

source: Please enter new password
ar: الرجاء إدخال كلمة المرور الجديدة

source: Please confirm password
ar: الرجاء تأكيد كلمة المرور

# forgotPasswordTitle
source: Forgot Password?
ar: نسيت كلمة المرور؟

source: Back to Login
ar: العودة لتسجيل الدخول

source: Sent successfully!
ar: تم الإرسال بنجاح!

# resetPasswordSent
source: Password reset link has been sent to your email
ar: تم إرسال رابط إعادة تعيين كلمة المرور إلى بريدك الإلكتروني

# resetPasswordTitle
source: Reset Password
ar: استعادة كلمة المرور

# resetPasswordDescription
source: Enter your email to send a reset link
ar: أدخل بريدك الإلكتروني لإرسال رابط إعادة تعيين

# sendResetLink
source: Send Link
ar: إرسال الرابط

source: Send to another email
ar: إرسال إلى بريد إلكتروني آخر

# exams
source: Exam
ar: الاختبار

# questionOf
source: Question {current} of {total}
ar: السؤال {current} من {total}

source: Finish Exam
ar: إنهاء الاختبار

source: Final Result
ar: النتيجة النهائية

source: Correct Answers
ar: الإجابات الصحيحة

source: Wrong Answers
ar: الإجابات الخاطئة

# notificationsTitle
source: Notifications
ar: الإشعارات

# science
source: Knowledge is the light that illuminates your path
ar: العلم نور يضيء طريقك

# success
source: Success starts with a step
ar: النجاح يبدأ بخطوة

# nextStep
source: Next
ar: التالي

source: Start Now
ar: ابدأ الآن

source: My Courses
ar: دوراتي

# subjects
source: Subject
ar: مادة

# lessonsCount
source: {count} lessons
ar: {count} درس

# coursesCount
source: {count} courses
ar: {count} دورات

source: Free
ar: مجاني

source: Paid
ar: مدفوع

source: All Courses
ar: جميع الدورات

# coursesAvailable
source: {count} courses available
ar: {count} دورة متاحة

# searchCourse
source: Search for a course...
ar: ابحث عن دورة...

source: No results
ar: لا توجد نتائج

# tryDifferentSearch
source: Try searching with different words or change filters
ar: جرب البحث بكلمات مختلفة أو تغيير الفلاتر

# egyptianPound
source: {amount} EGP
ar: {amount} ج.م

# noCourseData
source: No course data available
ar: لا توجد بيانات للدورة

source: Course Title
ar: عنوان الدورة

source: Trial Exam
ar: امتحان تجريبي

source: No lessons available
ar: لا توجد دروس متاحة

# certifiedCertificate
source: Certified certificate upon completion
ar: شهادة معتمدة عند الإكمال

source: Loading exam...
ar: جاري تحميل الامتحان...

source: No trial exam available
ar: لا يوجد امتحان تجريبي متاح

# startExamButton
source: Start Exam
ar: ابدأ الامتحان

source: Not Available
ar: غير متاح

source: Enrolling...
ar: جاري الاشتراك...

source: Start Learning Now
ar: ابدأ التعلم الآن

source: Enroll Free
ar: اشترك مجاناً

source: Enroll in Course
ar: اشترك في الدورة

source: Login required
ar: يجب تسجيل الدخول أولاً

# noQuestionsAvailable
source: No questions available in exam
ar: لا توجد أسئلة متاحة في الامتحان

# finishExamButton
source: Finish Exam
ar: إنهاء الامتحان

source: Loading questions...
ar: جاري تحميل الأسئلة...

source: Finish
ar: إنهاء

source: Download link unavailable
ar: رابط التحميل غير متاح

source: Downloading...
ar: جاري التحميل...

# cannotAccessDownloads
source: Cannot access downloads folder
ar: لا يمكن الوصول إلى مجلد التحميلات

# certificateCompletion
source: Certificate of Completion: {course}
ar: شهادة إتمام: {course}

# certificateNumber
source: Certificate Number: {number}
ar: رقم الشهادة: {number}

# verificationLink
source: Verification Link: {url}
ar: رابط التحقق: {url}

source: Download
ar: تحميل

source: Share
ar: مشاركة

source: No certificates yet
ar: لا توجد شهادات بعد

# completeCoursesForCertificates
source: Complete courses to get certified certificates
ar: أكمل الدورات للحصول على شهادات معتمدة

source: Getting download link...
ar: جاري الحصول على رابط التحميل...

source: Delete File
ar: حذف الملف

# confirmDeleteFile
source: Are you sure you want to delete this file?
ar: هل أنت متأكد من حذف هذا الملف؟

source: Cancel
ar: إلغاء

source: Delete
ar: حذف

source: No downloads
ar: لا توجد تحميلات

# willOpenOffline
source: Course will open in offline mode
ar: سيتم فتح الدورة في وضع عدم الاتصال

# noLiveSessions
source: No live sessions available
ar: لا توجد جلسات لايف متاحة

# sessionsComingSoon
source: Upcoming sessions will be added soon
ar: سيتم إضافة الجلسات القادمة قريباً

# willOpenSessionLink
source: Session link will open
ar: سيتم فتح رابط الجلسة

source: Session link unavailable
ar: رابط الجلسة غير متاح

source: Coming Soon
ar: قريباً

source: Starts in
ar: يبدأ خلال

source: hour
ar: ساعة

source: minute
ar: دقيقة

# confirmLogout
source: Are you sure you want to logout?
ar: هل أنت متأكد من تسجيل الخروج؟

source: Logging out...
ar: جاري تسجيل الخروج...

source: My Exams
ar: اختباراتي

# viewAllExams
source: View all completed exams
ar: عرض جميع الاختبارات المكتملة

source: Exam
ar: اختبار

source: No completed exams
ar: لا توجد اختبارات مكتملة

# startCompletingExams
source: Start completing exams to see your results here
ar: ابدأ في إكمال الاختبارات لرؤية نتائجك هنا

# ago
source: A while ago
ar: منذ فترة

# daysAgo
source: {count, plural, =1 {1 day ago} other {{count} days ago}}
ar: منذ {count} {count, plural, =1 {يوم} other {أيام}}

# hoursAgo
source: {count, plural, =1 {1 hour ago} other {{count} hours ago}}
ar: منذ {count} {count, plural, =1 {ساعة} other {ساعات}}

# minutesAgo
source: {count, plural, =1 {1 minute ago} other {{count} minutes ago}}
ar: منذ {count} {count, plural, =1 {دقيقة} other {دقائق}}

# activeCourse
source: {count} active courses
ar: {count} دورة نشطة

source: Delete Account
ar: حذف الحساب

source: My Account
ar: حسابي

source: Customize App
ar: تخصيص التطبيق

source: All Subjects
ar: جميع المواد

source: Weekly
ar: أسبوعي

source: Monthly
ar: شهري

source: Student Rating
ar: تصنيف الطلاب

source: Top 10 Students
ar: أفضل 10 طلاب

# myExamsButton
source: My Exams
ar: اختباراتي

source: View all completed exams
ar: عرض جميع الاختبارات المكتملة

# welcome
source: Welcome, {name} 👋
ar: مرحباً، {name} 👋

source: Visitor
ar: زائر

source: Excellent Student
ar: طالب متميز

source: Special Offer
ar: عرض خاص

# subscribeNowButton
source: Subscribe Now
ar: اشترك الآن

source: Enrolled Course
ar: كورس مشترك

source: Learning Hours
ar: ساعة تعلم

source: Continue Learning
ar: تابع التعلم

source: Recommended Courses
ar: دورات موصى بها

source: View More
ar: عرض المزيد

# searchPlaceholder
source: Search for a course, instructor, or topic...
ar: ابحث عن دورة، مدرب، أو موضوع...

source: No results found
ar: لا توجد نتائج

# selectSubject
source: Select the subject you want to learn
ar: اختر المادة التي تريد تعلمها

source: No categories
ar: لا توجد تصنيفات

# categoriesComingSoon
source: Categories will be added soon
ar: سيتم إضافة التصنيفات قريباً

# passwordMismatch
source: Passwords do not match
ar: كلمة المرور غير متطابقة

# passwordMinLength
source: Password must be at least 6 characters
ar: كلمة المرور يجب أن تكون 6 أحرف على الأقل

source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة

source: Invalid coupon code
ar: كود الخصم غير صحيح

source: Complete Purchase
ar: إتمام الشراء

source: Enter coupon code
ar: أدخل كود الخصم

source: Apply
ar: تطبيق

source: Payment Method
ar: طريقة الدفع

source: Fawry
ar: فوري

# payAtFawryBranch
source: Pay at any Fawry branch
ar: ادفع في أي فرع فوري

source: E-Wallet
ar: محفظة إلكترونية

# walletDescription
source: Vodafone Cash - Etisalat Cash - Orange Cash
ar: فودافون كاش - اتصالات كاش - أورانج كاش

source: Visa / Mastercard
ar: فيزا / ماستركارد

# creditDebitCard
source: Credit or Debit Card
ar: بطاقة ائتمان أو خصم

source: Order Summary
ar: ملخص الطلب

source: Course Price
ar: سعر الدورة

# egyptianPoundAmount
source: {amount} EGP
ar: {amount} جنيه

source: Confirm Payment
ar: تأكيد الدفع

source: Processing...
ar: جاري المعالجة...

source: No course
ar: لا توجد دورة

source: Date not specified
ar: تاريخ غير محدد

source: Certifies that
ar: يشهد بأن

# hasCompletedWithGrade
source: has completed this course with grade
ar: قد أتم هذه الدورة بتقدير

source: Excellent
ar: ممتاز

# math
source: Mathematics
ar: الرياضيات

source: Literature
ar: الأدب

source: Biology
ar: الأحياء

source: Physics
ar: الفيزياء

source: Chemistry
ar: الكيمياء

source: Practical Engineering
ar: الهندسة العملية

# creativePlaneShapes
source: Creative Approaches to Plane Shapes
ar: مناهج إبداعية للأشكال المستوية

# cellularBiologyDiscoveries
source: Discoveries in Cellular Biology
ar: اكتشافات في علم الأحياء الخلوية

source: Introduction
ar: المقدمة

source: What is Design?
ar: ما هو التصميم؟

source: How to Create Wireframe
ar: كيفية إنشاء الإطار السلكي

source: Your First Design
ar: تصميمك الأول

source: Progress: {percent}%
ar: التقدم: {percent}%

source: Hello, Jacob 👋
ar: مرحباً، يعقوب 👋

# startLearningJourneyMessage
source: Start your learning journey and enroll in your first course
ar: ابدأ رحلة التعلم واشترك في دورتك الأولى

source: Learn Easily
ar: تعلم بسهولة

source: Continuous Progress
ar: تقدم مستمر

# discoverBestCourses
source: Discover the best educational courses with professional teachers from around the world
ar: اكتشف أفضل الدورات التعليمية مع مدرسين محترفين من جميع أنحاء العالم

# trackProgressAndGetCertificates
source: Track your progress and get certified certificates upon course completion
ar: تابع تقدمك واحصل على شهادات معتمدة عند إتمام الدورات

source: Smart Learning Platform
ar: منصة التعليم الذكية

# certifiedAndSecure
source: Certified and Secure Platform
ar: منصة معتمدة وآمنة

# everyDayNewOpportunity
source: Every day is a new opportunity to learn
ar: كل يوم فرصة جديدة للتعلم

# enrolledCoursesCount
source: {count} enrolled courses
ar: {count} دورات مسجلة

source: Average Progress
ar: متوسط التقدم

source: Completed
ar: مكتملة

# lessonFrom
source: Lesson {current} of {total}
ar: الدرس {current} من {total}

# hourShort
source: h
ar: س

# timeAgo
source: A while ago
ar: منذ فترة

# noEnrolledCourses
source: You haven't enrolled in any courses yet
ar: لم تشترك في أي دورة بعد

source: Explore Courses
ar: استكشف الدورات

source: No Title
ar: بدون عنوان

# egyptianPoundShort
source: EGP
ar: ج.م

# errorLoadingNotifications
source: Failed to load notifications: {error}
ar: فشل تحميل الإشعارات: {error}

# errorUpdatingNotification
source: Failed to update notification: {error}
ar: فشل تحديث الإشعار: {error}

# errorUpdatingNotifications
source: Failed to update notifications: {error}
ar: فشل تحديث الإشعارات: {error}

source: New Notifications
ar: إشعارات جديدة

# newNotificationsCount
source: {count} new notifications
ar: {count} إشعارات جديدة

source: Mark All as Read
ar: تحديد الكل كمقروء

# newSection
source: New
ar: جديد

source: Past
ar: سابقة

source: No Notifications
ar: لا توجد إشعارات

# newNotificationsWillAppear
source: New notifications will appear here
ar: ستظهر الإشعارات الجديدة هنا

source: Recently
ar: منذ قليل

# minutesAgoShort
source: {count} minutes ago
ar: منذ {count} دقيقة

# hoursAgoShort
source: {count} hours ago
ar: منذ {count} ساعة

# daysAgoShort
source: {count} days ago
ar: منذ {count} يوم

source: Total Exams
ar: إجمالي الاختبارات

source: Passed
ar: ناجح

source: Failed
ar: راسب

source: Undefined date
ar: تاريخ غير محدد

# monthJanuary
source: January
ar: يناير

# monthFebruary
source: February
ar: فبراير

# monthMarch
source: March
ar: مارس

# monthApril
source: April
ar: أبريل

# monthMay
source: May
ar: مايو

# monthJune
source: June
ar: يونيو

# monthJuly
source: July
ar: يوليو

# monthAugust
source: August
ar: أغسطس

# monthSeptember
source: September
ar: سبتمبر

# monthOctober
source: October
ar: أكتوبر

# monthNovember
source: November
ar: نوفمبر

# monthDecember
source: December
ar: ديسمبر

# downloadedFiles
source: {count, plural, =1 {downloaded file} other {downloaded files}}
ar: {count, plural, =1 {ملف محمل} other {ملفات محملة}}

source: Storage
ar: مساحة التخزين

# storageUsed
source: {used} GB of {limit} GB used
ar: {used} GB من {limit} GB مستخدم

source: File
ar: ملف

source: Undefined size
ar: حجم غير محدد

source: Watch Offline
ar: مشاهدة بدون إنترنت

source: File ID not available
ar: معرف الملف غير متاح

source: Download link not available
ar: رابط التحميل غير متاح

# downloadLinkObtained
source: Download link obtained. Download will start soon...
ar: تم الحصول على رابط التحميل. سيتم التحميل قريباً...

# courseWillOpenOffline
source: Course will open in offline mode
ar: سيتم فتح الدورة في وضع عدم الاتصال

source: Course ID not available
ar: معرف الدورة غير متاح

source: Download courses to watch offline
ar: حمّل الدورات لمشاهدتها بدون إنترنت

# liveSessionsCount
source: {count} {count, plural, =1 {session} other {sessions}} {status}
ar: {count} جلسات {status}

source: live
ar: مباشرة

source: upcoming
ar: قادمة

source: Live Session
ar: جلسة لايف

source: Live Now
ar: مباشر الآن

source: Remind Me
ar: تذكيري

source: Join Now
ar: انضم الآن

# registeredForSession
source: Successfully registered for session
ar: تم التسجيل في الجلسة بنجاح

source: Must login first
ar: يجب تسجيل الدخول أولاً

source: day
ar: يوم

source: second
ar: ثانية

# oneHour
source: 1 hour
ar: 1 ساعة

# achievedCertificates
source: {count} achieved certificates
ar: {count} شهادات محققة

source: Certificate of Completion
ar: شهادة إتمام

# downloadFailed
source: Download failed: {code}
ar: فشل التحميل: {code}

# certificateNumberLabel
source: Certificate Number
ar: رقم الشهادة

# verificationLinkLabel
source: Verification Link
ar: رابط التحقق

source: Center Attendance
ar: حضور السنتر

# centerAttendanceDescription
source: Show this QR code at the center to mark your attendance
ar: اعرض هذا الكود عند السنتر لتسجيل حضورك

source: Loading QR code...
ar: جاري تحميل الكود...

source: Error loading QR code
ar: حدث خطأ أثناء تحميل الكود

# scanQrCodeInstruction
source: Show this QR code to the center staff to mark your attendance
ar: اعرض هذا الكود لموظفي السنتر لتسجيل حضورك

source: Refresh QR Code
ar: تحديث الكود

source: Retry
ar: إعادة المحاولة

# unknownError
source: Unknown error occurred
ar: حدث خطأ غير معروف

source: Teachers
ar: المعلمون

source: All Teachers
ar: جميع المعلمين

# teacherFallback
source: Teacher
ar: المعلم

# teacherCoursesTitle
source: Courses offered
ar: الدورات المقدمة

# studentsCount
source: {count} students
ar: {count} طالب
